def check_grade():
    # Получаем балл от пользователя
    score = int(input("Введите ваш балл: "))

    # Проверяем условия по убыванию. Первое же верное условие выполнится
    if score >= 90:
        print("Отлично")
    # Эта проверка сработает, только если первая была ложной
    elif score >= 70:
        print("Хорошо")
    # Эта - если первые две были ложными
    elif score >= 40:
        print("Удовлетворительно")
    # Блок else выполняется, если ни одно из условий выше не сработало
    else:
        print("Не сдал")

check_grade()