# Импортируем модуль для работы со случайными числами
import random

def secret_game():
    # Компьютер "загадывает" число от 1 до 10
    secret = random.randint(1, 10)
    guess = 0 # Переменная для хранения догадки пользователя

    # Цикл работает, пока догадка не совпадет с загаданным числом
    while secret != guess:
        # Получаем ввод от пользователя и превращаем его в число
        guess = int(input("Угадайте число от 1 до 10: "))

    # Цикл завершился, значит число угадано
    print("Поздравляю! Вы угадали число.")

secret_game()